Revit 2024 API
Application.CurrentUsersDataFolderPath Property
 Path to data folder for the current user.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public string CurrentUsersDataFolderPath { get; }
Visual Basic
Public ReadOnly Property CurrentUsersDataFolderPath As String
	Get
Visual C++
public:
property String^ CurrentUsersDataFolderPath {
	String^ get ();
}
Remarks
 Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace